Revit 2024 API
PanelScheduleView.GetLoadClassificationName Method
 Gets the name of the Load Classification at the given row/column
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string GetLoadClassificationName(
	int nRow,
	int nCol
)
Visual Basic
Public Function GetLoadClassificationName ( _
	nRow As Integer, _
	nCol As Integer _
) As String
Visual C++
public:
String^ GetLoadClassificationName(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 Row Number of the Load Summary Section
nCol
Type: System.Int32
 Column number of Load Summary Section
Return Value
 The name of the Load Classification
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary.
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace